app/controllers/admin_controller.rb

  def index
  	@mailsReceived = Mail.all.where(to: session[:user_name])
  	@mailsCount = Mail.all.count
---
SELECT "mails".* FROM "mails" WHERE "mails"."to" = 'admin'
SELECT COUNT(*) FROM "mails"