app/controllers/sessions_controller.rb

  def create
    user = User1.find_by(name: params[:name])
---
SELECT "user1s".* FROM "user1s" WHERE "user1s"."name" = 'admin' LIMIT 1