app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 26 Sep 2014 05:51:19 UTC +00:00], ["email", "beep"], ["name", "harsh"], ["password", "beep"], ["updated_at", Fri, 26 Sep 2014 05:51:19 UTC +00:00]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save