app/controllers/user1s_controller.rb

  def index
    #@user1s = User1.all
    @user1s = User1.order(:name)
---
SELECT "user1s".* FROM "user1s" ORDER BY "user1s".name ASC

  def create
    @user1 = User1.new(user1_params)
    #flash[:alert] = user1_params
    respond_to do |format|
      if @user1.save
---
INSERT INTO "user1s" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @user1.destroy
---
DELETE FROM "user1s" WHERE "user1s"."id" = ?  [["id", 2]]

    def set_user1
      if params[:id]
        @user1 = User1.find(params[:id])
---
SELECT "user1s".* FROM "user1s" WHERE "user1s"."id" = ? LIMIT 1  [["id", "2"]]